#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`


<details><summary>Show Plan</summary>

```

terraform
null_resource.always_run: Refreshing state... [id=6543033984751691729]
aws_iam_policy.cloudresume_api_policy: Refreshing state... [id=arn:aws:iam::590183883549:policy/cloudresume_api_policy]
aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:590183883549:certificate/6359f581-1dc8-4f77-b9dd-de5f488ed965]
aws_api_gateway_rest_api.mscc_cloud_resume_challenge_api: Refreshing state... [id=2fue365hqi]
aws_s3_bucket_server_side_encryption_configuration.crc_bucket: Refreshing state... [id=mscc-crc-bucket-albert-einstein]
aws_dynamodb_table.cloudresumechallenge: Refreshing state... [id=cloudresume]
aws_iam_role.cloudresume_api_role: Refreshing state... [id=cloudresume_api_role]
aws_s3_bucket.crc_bucket: Refreshing state... [id=mscc-crc-bucket-albert-einstein]
aws_api_gateway_resource.visits_resource: Refreshing state... [id=jzpsvi]
aws_cloudfront_distribution.distribution: Refreshing state... [id=E2IPRASSM28S5J]
aws_api_gateway_resource.update_resource: Refreshing state... [id=cxxxb9]
aws_api_gateway_method.visits_get_method: Refreshing state... [id=agm-2fue365hqi-jzpsvi-GET]
aws_iam_role_policy_attachment.cloudresume_api_policy_attachment: Refreshing state... [id=cloudresume_api_role-20240713204705538100000001]
aws_lambda_function.update_counter: Refreshing state... [id=cloudresume-api-update]
aws_lambda_function.retrieve_counter: Refreshing state... [id=cloudresume-api-retrieve]
aws_api_gateway_method.update_get_method: Refreshing state... [id=agm-2fue365hqi-cxxxb9-GET]
aws_lambda_permission.visits_lambda_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.visits_get_integration: Refreshing state... [id=agi-2fue365hqi-jzpsvi-GET]
aws_lambda_permission.update_lambda_permission: Refreshing state... [id=AllowAPIGatewayInvoke]
aws_api_gateway_integration.update_get_integration: Refreshing state... [id=agi-2fue365hqi-cxxxb9-GET]
aws_api_gateway_deployment.deployment: Refreshing state... [id=epc58b]
aws_api_gateway_stage.prod: Refreshing state... [id=ags-2fue365hqi-prod]
aws_s3_bucket_public_access_block.crc_bucket_public_access_block: Refreshing state... [id=mscc-crc-bucket-albert-einstein]
aws_s3_bucket_policy.crc_bucket_policy: Refreshing state... [id=mscc-crc-bucket-albert-einstein]
aws_s3_bucket_website_configuration.crc_bucket_website: Refreshing state... [id=mscc-crc-bucket-albert-einstein]
aws_s3_object.crc_object["assets/index-VhKdceuh.js"]: Refreshing state... [id=assets/index-VhKdceuh.js]
aws_s3_object.crc_object["index.html"]: Refreshing state... [id=index.html]
aws_s3_object.crc_object["favicon.ico"]: Refreshing state... [id=favicon.ico]
aws_s3_object.crc_object["assets/index-DQwUGtFP.css"]: Refreshing state... [id=assets/index-DQwUGtFP.css]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # aws_s3_object.crc_object["assets/index-DQwUGtFP.css"] has changed
  ~ resource "aws_s3_object" "crc_object" {
        id                     = "assets/index-DQwUGtFP.css"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.crc_object["assets/index-VhKdceuh.js"] has changed
  ~ resource "aws_s3_object" "crc_object" {
        id                     = "assets/index-VhKdceuh.js"
      + metadata               = {}
      + tags                   = {}
        # (11 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_s3_object.crc_object["assets/index-CZrlT4JS.js"] will be created
  + resource "aws_s3_object" "crc_object" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "mscc-crc-bucket-albert-einstein"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content_type           = "text/javascript"
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "assets/index-CZrlT4JS.js"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + source                 = "html-files/assets/index-CZrlT4JS.js"
      + storage_class          = (known after apply)
      + tags_all               = (known after apply)
      + version_id             = (known after apply)
    }

  # aws_s3_object.crc_object["assets/index-DQwUGtFP.css"] will be updated in-place
  ~ resource "aws_s3_object" "crc_object" {
      ~ etag                   = "f40c4c1aff53ae1b57f144531a38b317" -> (known after apply)
        id                     = "assets/index-DQwUGtFP.css"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.crc_object["assets/index-VhKdceuh.js"] will be destroyed
  # (because key ["assets/index-VhKdceuh.js"] is not in for_each map)
  - resource "aws_s3_object" "crc_object" {
      - arn                    = "arn:aws:s3:::mscc-crc-bucket-albert-einstein/assets/index-VhKdceuh.js" -> null
      - bucket                 = "mscc-crc-bucket-albert-einstein" -> null
      - bucket_key_enabled     = false -> null
      - content_type           = "text/javascript" -> null
      - etag                   = "d0d50fbb2563d71728f68d3033bdf747" -> null
      - force_destroy          = false -> null
      - id                     = "assets/index-VhKdceuh.js" -> null
      - key                    = "assets/index-VhKdceuh.js" -> null
      - metadata               = {} -> null
      - server_side_encryption = "AES256" -> null
      - source                 = "html-files/assets/index-VhKdceuh.js" -> null
      - storage_class          = "STANDARD" -> null
      - tags                   = {} -> null
      - tags_all               = {} -> null
    }

  # aws_s3_object.crc_object["favicon.ico"] will be updated in-place
  ~ resource "aws_s3_object" "crc_object" {
      ~ etag                   = "b2c482ebd8f3c55a22c2ea38629455f6" -> (known after apply)
        id                     = "favicon.ico"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.crc_object["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "crc_object" {
      ~ etag                   = "dda5db95e5572f56478e62de63b757cc" -> (known after apply)
        id                     = "index.html"
        tags                   = {}
      + version_id             = (known after apply)
        # (11 unchanged attributes hidden)
    }

  # null_resource.always_run must be replaced
-/+ resource "null_resource" "always_run" {
      ~ id       = "6543033984751691729" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "2024-07-23T16:01:40Z" -> (known after apply)
        }
    }

Plan: 2 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>
Pushed by: @derecklhw, Action: `pull_request`